tests/api/test-api-jmeter.yml
modules:
  console:
    disable: true

provisioning: local
aggregator: consolidator

execution:
  - executor: jmeter
    concurrency: 25
    hold-for: 3m
    ramp-up: 1m
    scenario: crud_test

scenarios:
  crud_test:
    variables:
      post_id: 1

    requests:
      - label: Create Post
        method: POST
        url: http://localhost:8000/posts
        headers:
          Content-Type: application/json
        body: |
          {
            "title": "Load Test Post",
            "body": "Generated by Taurus",
            "userId": 1
          }
        extract-jsonpath:
          post_id: "$.id"
        assertions:
          - subject: http-code
            equals: 200

      - label: Get Created Post
        method: GET
        url: http://localhost:8000/posts/${post_id}
        assertions:
          - subject: http-code
            equals: 200

      - label: Update Created Post
        method: PUT
        url: http://localhost:8000/posts/${post_id}
        headers:
          Content-Type: application/json
        body: |
          {
            "title": "Updated Title",
            "body": "Updated Body",
            "userId": 1
          }
        assertions:
          - subject: http-code
            equals: 200

      - label: Delete Created Post
        method: DELETE
        url: http://localhost:8000/posts/${post_id}
        assertions:
          - subject: http-code
            equals: 200

reporting:
  - module: console
  - module: final-stats
  - module: junit-xml

passfail:
  - criteria: "fail > 0%"
    stop: true
    label: "any-failures"