tests/api/test-api-jmeter.yml
---
scenarios:
  jmeter_test:
    requests:
      - url: http://localhost:8000/get
        label: Get Post 1

      - url: http://localhost:8000/post
        method: POST
        label: Create Post
        body:
          title: Test Post
          body: Test Body
          userId: 1

execution:
  - concurrency: 25
    hold-for: 3m
    ramp-up: 1m
    scenario: jmeter_test

reporting:
  - module: jmeter
  - module: final-stats