tests/api/test-api-load.yml
---
scenarios:
  api_test:
    requests:
      - url: http://localhost:8000/get
        label: Get Request

      - url: http://localhost:8000/post
        method: POST
        label: Create Post
        body:
          title: Test Post
          body: This is a test post
          userId: 1

execution:
  - concurrency: 10
    hold-for: 1m
    scenario: api_test

reporting:
  - module: final-stats