tests/api/test-api-stress.yml
---
scenarios:
  stress_test:
    requests:
      - url: http://localhost:8000/get
        label: Get All Posts

      - url: http://localhost:8000/json
        label: Get All Comments

execution:
  - concurrency: 100
    hold-for: 5m
    ramp-up: 1m
    scenario: stress_test

reporting:
  - module: final-stats